#include"view.h"


/*
	函数名：main_view
	返回值：无
	函数功能：主界面
*/
void main_view(){
	printf("\n");	
	printf(" *************************************\n");
	printf(" *      欢迎进入中国福利彩票中心     *\n");
	printf(" *************************************\n");
	printf("	     ***********\n");
	printf("	     * 1->登录 *\n");
	printf("	     * 2->注册 *\n");
	printf("	     * 0->退出 *\n");
	printf("	     ***********\n");
	printf("请选择：\n");

}


/*
	函数名：user_view
	返回值：无
	函数功能：用户界面
*/
void user_view(){
	printf("\n");
	printf("**************************\n");
	printf("*    欢迎进入用户界面    *\n");
	printf("**************************\n");
	printf("   ********************\n");
	printf("   * 1->查看个人信息  *\n");
	printf("   * 2->修改个人密码  *\n");
	printf("   * 3->注销个人信息  *\n");
	printf("   * 4->充       值   *\n");
	printf("   * 5->查询中奖记录  *\n");
	printf("   * 6->手 动 下 注   *\n");
	printf("   * 7->机 器 下 注   *\n");
	printf("   * 8->查询购票记录  *\n");
	printf("   * 9->游       戏   *\n");
	printf("   * 0->返回上一级    *\n");
	printf("   ********************\n");
	printf("请选择:\n");
}



/*
	函数名：admin_view
	返回值：无
	函数功能：管理员界面
*/
void admin_view(){
	printf("\n");
	printf("****************************\n");
	printf("*    欢迎进入管理员界面    *\n");
	printf("****************************\n");
	printf("    ********************\n");
	printf("    * 1->发 行 彩 票   *\n");
	printf("    * 2->用户帐号查询  *\n");
	printf("    * 3->用户余额排序  *\n");
	printf("    * 4->全部用户信息  *\n");
	printf("    * 5->用户购票记录  *\n");
	printf("    * 6->每期彩票信息  *\n");
	printf("    * 0->返回上一级    *\n");	
	printf("    ********************\n");
	printf("请选择：\n");	
}


/*
	函数名：worker_view
	返回值：无
	函数功能：公证员界面
*/
void worker_view(){
	printf("\n");
	printf("*****************************\n");
	printf("*     欢迎进入公证员界面    *\n");
	printf("*****************************\n");
	printf("    *********************\n");
	printf("    * 1->机 器 开 奖    *\n");
	printf("    * 2->手 动 开 奖    *\n");
	printf("    * 3->历 史 发 行    *\n");
	printf("    * 0->返回上一级菜单 *\n");
	printf("    *********************\n");
	printf("请选择：\n");
}



