/*
	冒泡排序
	选择排序
	快速排序
	
	二维数组
		（1，2，3，4）括号和逗号组成逗号表达式，取最后一个值。
		int(* a)[3] 和 int a[][3] 一样
		二维数是连续的，可以越界，但是不要越出主函数
		

*/
//-------------------杨辉三角形--------

#include<stdio.h>
int main()
{
	int a[10][10] = {0};
	int i = 0 , j = 0;
	for (i = 0;i<10;i++){
		for (j = 0; j<=i; j++){
			if(j == 0 || i == j){
				a[i][j] = 1;
			}else if (j!= 0 && j!=i && i>1){
				a[i][j] = a[i-1][j-1] +a[i-1][j];
			
			}
			//printf("%d ",a[i][j]);
		}
		for (j = 0; j<10-i;j++){
			printf("  ");
		}
		for (j = 0; j<=i; j++){
				printf("%4d",a[i][j]);
		}
		printf("\n");
	}
	return 0;
}


/*
1
1 1
1 2 1
1 3 3 1
*/

//--------------周长-------------------
/*
#include<stdio.h>
int main(){
	int arr[5][5] = {
						{1 ,2 ,3 ,4 ,1 },
						{4 ,2 ,6 ,2 ,8 },
						{7 ,8 ,3 ,10,11},
						{10,4,12,4,14},
						{5,14,15,16,5},
					};

	int i = 0, j = 0,res = 0;
	for (i = 0; i< 5; i++){
		for(j = 0; j<5 ; j++){
			if(i ==0 || j==0 ||i==4 ||j ==4){
				res = res + arr[i][j];
			}
		}
	
	}
	printf("%d\n",res);
	return 0;
}
*/
